{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc_1/prediction/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "out/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "layer_1/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "layer_1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/w"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "layer_1/add", "op": "Add", "input": ["layer_1/MatMul", "layer_1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["layer_1/Relu", "layer_2/w"], "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "layer_2/add", "op": "Add", "input": ["layer_2/MatMul", "layer_2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "out/w"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "out/add", "op": "Add", "input": ["out/MatMul", "out/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc_1/prediction", "op": "ArgMax", "input": ["out/Softmax", "accuracy_calc_1/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_calc_1/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "out/b", "shape": [10], "dtype": "float32"}, {"name": "out/w", "shape": [64, 10], "dtype": "float32"}, {"name": "layer_2/b", "shape": [64], "dtype": "float32"}, {"name": "layer_2/w", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_1/b", "shape": [512], "dtype": "float32"}, {"name": "layer_1/w", "shape": [784, 512], "dtype": "float32"}]}]}